[
  {
    "id": "MATH2033",
    "title": "College and Advanced Algebra",
    "description": "This course is an extension of college algebra. It deals with solutions of higher degree equations, specifically polynomial equations and polynomial functions. It also covers an extensive discussion on variations, sequences and logarithmic functions, complex numbers and determinants. Students are expected to demonstrate computational and problem solving skills with speed and accuracy. Topics may include: review of elementary algebra, algebraic relationships, functions and graphs, quadratic and rational inequalities, linear and quadratic variables, remainder and factor theorems and exponential and logarithmic functions.",
    "slug": "math2033"
  },
  {
    "id": "MATH2044",
    "title": "Plane & Spherical Trigonometry, Analytic & Solid Geometry",
    "description": "This course provides students with basic knowledge and skills in plane Euclidean Geometry using inductive and deductive methods. It also includes the study of trigonometric functions and their inverses, including their graphs, characteristics, and applications, trigonometric identities, problem solving, spherical trigonometry, analytic trigonometry, coordinates and transformation of coordinates, and polar coordinates.",
    "slug": "math2044"
  },
  {
    "id": "MATH2074",
    "title": "Differential and Integral Calculus 1",
    "description": "This course covers topics of differential and integral calculus including limits and continuity, higher-order derivatives, curve sketching, differentials, definite and indefinite integrals (areas and volumes), and applications of derivatives and integrals. It establishes the fundamental theorems and applications of calculus of single variable functions and provides mathematical tools necessary for more advanced STEM fields. Topics include functions, limit concept, the derivative, applications of differentiation, and introduction to integration.",
    "slug": "math2074"
  },
  {
    "id": "MATH2094",
    "title": "Differential and Integral Calculus 2",
    "description": "This second course in analysis covers differentiation and integration of exponential, logarithm and trigonometric functions; the concepts of the definite and indefinite integral and some applications of the definite integral. It includes integration formulas, techniques, and applications to areas, volumes, work, and force.  It may also cover differential equations, sequences and series, and parametric equations and polar coordinates.",
    "slug": "math2094"
  }
]
